Repository: nonZero/Turtles
Catalog: obs/locale/*/LC_MESSAGES/django.po
Languages: he

source: Unknown
he: לא ידוע

source: Long
he: ארוך

source: Short
he: קצר

source: Injured Turtle
he: צב פצוע

source: Live Turtle
he: צב חי

source: Dead Turtle
he: צב מת

source: On the shore
he: על החוף

source: At Sea level, less than 5m deep
he: עד עומק 5 מ' מפני הים

source: Deeper than 5m deep
he: בעומק הים, מעל 5 מ'

source: On the Sea bottom
he: על קרקעית הים

source: Chelonia mydas, Green Sea Turtle
he: צב-ים ירוק

source: Carette caretta, Loggerhead Sea Turtle
he: צב-ים חום

source: Eretmochelys imbricata, Hawksbill Sea Turtle
he: צב-ים קרני

source: Dermochelys coriacea, Leatherback Sea Turtle
he: צב-ים גלדי

source: Trionyx triunguis, Nile Soft Shell Turtle
he: צב-רך

source: Mauremys caspica, Caspian Turtle
he: צב-ביצה

source: Breathing
he: נושם

source: Breeding
he: הזדווגות

source: Feeding
he: אכילה

source: Nesting
he: קינון

source: Sleeping
he: לינה

source: Swimming
he: שחיה

source: Other
he: התנהגות אחרת

source: Your Name
he: השם שלך

source: Your Email
he: הדואל שלך

source: Your Phone
he: הטלפון שלך

source: Observer
he: שם המדווח

source: Email
he: דוא"ל

source: Phone
he: טלפון

source: created at
he: מועד יצירה

source: Observation Date
he: תאריך תצפית

source: Observation Time
he: שעת תצפית

source: point
he: נקודה

source: Turtle Status
he: שלומו של הצב

source: Turtle Place
he: מקום המצאו של הצב

source: Turtle Species
he: מין הצב

source: Turtle Behaviour
he: התנהגות הצב

source: Tail Length
he: אורך זנב

source: Observation Description
he: תיאור התצפית

source: Anything else you want to tell us? Did the turtle have a tag on it?
he: משהו מעניין נוסף? האם לצב היה תג?

source: turtle observation
he: תצפית בצב

source: turtle observations
he: תצפיות בצבים

source: turtle observation email
he: דואל לתצפית בצב

source: turtle observation emails
he: הודעות דואל לתצפית בצב

source: image
he: תמונה

source: turtle observation photo
he: תמונה לתצפית בצב

source: turtle observation photos
he: תמונות תצפית בצב

source: Turtle Observation
he: תצפית בצבים

source: by
he: מאת

source: from
he: מאת

source: Add photos via email
he: הוספת תמונות באמצעות הדואל

source: Upload a photo
he: העלאת תמונה מהדפדפן

source: Email is recommended for mobile devices
he: במכשירים ניידים מומלץ להוסיף תמונות באמצעות הדואר האלקטרוני

source: Add Turtle Observation
he: הוספת תצפית בצבים

source: Save and continue to upload
he: שמור תצפית והמשך להוספת תמונות

source: Add Photo
he: הוספת תמונה

source: Upload
he: העלאה
